PureBulb/stm32_CompositeDevice/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c
/* USB CUSTOM_HID device Configuration Descriptor */
__ALIGN_BEGIN static uint8_t
    USBD_CUSTOM_HID_Desc[USB_CUSTOM_HID_DESC_SIZ] __ALIGN_END = {
        /* 18 */
        0x09, /*bLength: CUSTOM_HID Descriptor size*/
        CUSTOM_HID_DESCRIPTOR_TYPE, /*bDescriptorType: CUSTOM_HID*/
        0x11, /*bCUSTOM_HIDUSTOM_HID: CUSTOM_HID Class Spec release number*/
        0x01,
        0x00, /*bCountryCode: Hardware target country*/
        0x01, /*bNumDescriptors: Number of CUSTOM_HID class descriptors to
                 follow*/
        0x22, /*bDescriptorType*/
        USBD_CUSTOM_HID_REPORT_DESC_SIZE, /*wItemLength: Total length of Report
                                             descriptor*/
        0x00,
};
/**
 * @}
 */

/** @defgroup USBD_CDC_Private_Functions
 * @{
 */

/**
 * @brief  USBD_CDC_Init
 *         Initialize the CDC interface
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static int8_t CDC_Parse_Configuration(USBD_HandleTypeDef* pdev,
                                      USBD_CDC_ItfTypeDef* fops,
                                      uint8_t* cfgData, uint16_t length);
static int8_t CDC_Parse_Interface(USBD_HandleTypeDef* pdev,
                                  USBD_CDC_ItfTypeDef* fops,
                                  uint8_t* interfaceData, uint8_t* endpointNum);
static int8_t CDC_Parse_Endpoint(USBD_CDC_ItfTypeDef* fops,
                                 uint8_t* endpointData);
static uint8_t USBD_CDC_Init(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    uint8_t ret = 0U;
    USBD_CDC_HandleTypeDef* hcdc;
    for (uint8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        if (pdev->dev_speed == USBD_SPEED_HIGH)
        {
            /* Open EP IN */
            for (uint8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
            {
                uint8_t epAddr = fops->interfaceEpAddr[epIndex];
                uint8_t epAttr = fops->interfaceEpAttr[epIndex];
                if ((epAddr & 0x80U) != 0U)
                {  // IN endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_HS_IN_PACKET_SIZE);
                    pdev->ep_in[epAddr & 0xFU].is_used = 1U;
                }
                else
                {  // OUT endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_HS_OUT_PACKET_SIZE);
                    pdev->ep_out[epAddr & 0xFU].is_used = 1U;
                }
            }
        }
        else
        {
            /* Open EP IN */
            for (uint8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
            {
                uint8_t epAddr = fops->interfaceEpAddr[epIndex];
                uint8_t epAttr = fops->interfaceEpAttr[epIndex];
                if ((epAddr & 0x80U) != 0U)
                {  // IN endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_FS_IN_PACKET_SIZE);
                    pdev->ep_in[epAddr & 0xFU].is_used = 1U;
                }
                else
                {  // OUT endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_FS_OUT_PACKET_SIZE);
                    pdev->ep_out[epAddr & 0xFU].is_used = 1U;
                }
            }
        }
    }
    /* Open Command IN EP */
    // USBD_LL_OpenEP(pdev, CDC_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
    // pdev->ep_in[CDC_CMD_EP & 0xFU].is_used = 1U;
    for (uint8_t i = 0; i < pdev->interfaceSize; i++)
    {
        pdev->pClassData[i] = USBD_malloc(sizeof(USBD_CDC_HandleTypeDef));
        if (pdev->pClassData[i] == NULL)
        {
            ret = 1U;
        }
        else
        {
            hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[i];

            /* Init  physical Interface components */
            ((USBD_CDC_ItfTypeDef*)pdev->pUserData[i])->Init();

            /* Init Xfer states */
            hcdc->TxState = 0U;
            hcdc->RxState = 0U;
            USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
            if (pdev->dev_speed == USBD_SPEED_HIGH)
            {
                /* Prepare Out endpoint to receive next packet */
                for (uint8_t epIdx = 0; epIdx < fops->endpointSize; epIdx++)
                {
                    uint8_t epAddr = fops->interfaceEpAddr[epIdx];
                    if ((epAddr & 0x80U) == 0U)
                    {  // OUT endpoint
                        USBD_LL_PrepareReceive(pdev, epAddr, hcdc->RxBuffer,
                                               CDC_DATA_HS_OUT_PACKET_SIZE);
                    }
                }
            }
            else
            {
                /* Prepare Out endpoint to receive next packet */
                for (uint8_t epIdx = 0; epIdx < fops->endpointSize; epIdx++)
                {
                    uint8_t epAddr = fops->interfaceEpAddr[epIdx];
                    if ((epAddr & 0x80U) == 0U)
                    {  // OUT endpoint
                        USBD_LL_PrepareReceive(pdev, epAddr, hcdc->RxBuffer,
                                               CDC_DATA_FS_OUT_PACKET_SIZE);
                    }
                }
            }
        }
    }
    return ret;
}

/**
 * @brief  USBD_CDC_Init
 *         DeInitialize the CDC layer
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_CDC_DeInit(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    uint8_t ret = 0U;
    for (uint8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        for (uint8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
        {
            uint8_t epAddr = fops->interfaceEpAddr[epIndex];
            /* Close EP */
            USBD_LL_CloseEP(pdev, epAddr);
            if ((epAddr & 0x80U) != 0U)
            {
                pdev->ep_in[epAddr & 0xFU].is_used = 0U;
            }
            else
            {
                pdev->ep_out[epAddr & 0xFU].is_used = 0U;
            }
        }
        if (pdev->pClassData[i] != NULL)
        {
            ((USBD_CDC_ItfTypeDef*)pdev->pUserData[i])->DeInit();
            USBD_free(pdev->pClassData[i]);
            pdev->pClassData[i] = NULL;
        }
    }
    /* DeInit  physical Interface components */
    return ret;
}

/**
 * @brief  USBD_CDC_Setup
 *         Handle the CDC specific requests
 * @param  pdev: instance
 * @param  req: usb requests
 * @retval status
 */
static int8_t CDC_GetInterfaceIndexFromSetup(USBD_HandleTypeDef* pdev,
                                             USBD_SetupReqTypedef* req)
{
    uint8_t recipient = req->bmRequest & 0x1F;  // 低 5 位 = Recipient

    switch (recipient)
    {
        case USB_REQ_RECIPIENT_INTERFACE:
        {
            uint8_t if_num = (uint8_t)(req->wIndex & 0xFF);
            return USBD_CDC_GetInterfaceIndexByIfNum(pdev, if_num);
        }

        case USB_REQ_RECIPIENT_ENDPOINT:
        {
            uint8_t ep_addr = (uint8_t)(req->wIndex & 0xFF);
            return USBD_CDC_GetInterfaceIndexByEpNum(pdev, ep_addr);
        }

        default:
            // 既不是 interface 也不是 endpoint，就没有对应 CDC interface
            return -1;
    }
}
static uint8_t USBD_CDC_Setup(USBD_HandleTypeDef* pdev,
                              USBD_SetupReqTypedef* req)
{
    int8_t interfaceIndex = CDC_GetInterfaceIndexFromSetup(pdev, req);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];
    uint8_t ifalt = 0U;
    uint16_t status_info = 0U;
    uint8_t ret = USBD_OK;

