PureBulb/stm32_CompositeDevice/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c
    switch (req->bmRequest & USB_REQ_TYPE_MASK)
    {
        case USB_REQ_TYPE_CLASS:
            if (req->wLength)
            {
                if (req->bmRequest & 0x80U)
                {
                    ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
                        ->Control(req->bRequest, (uint8_t*)(void*)hcdc->data,
                                  req->wLength);

                    USBD_CtlSendData(pdev, (uint8_t*)(void*)hcdc->data,
                                     req->wLength);
                }
                else
                {
                    hcdc->CmdOpCode = req->bRequest;
                    hcdc->CmdLength = (uint8_t)req->wLength;

                    USBD_CtlPrepareRx(pdev, (uint8_t*)(void*)hcdc->data,
                                      req->wLength);
                }
            }
            else
            {
                ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
                    ->Control(req->bRequest, (uint8_t*)(void*)req, 0U);
            }
            break;

        case USB_REQ_TYPE_STANDARD:
            switch (req->bRequest)
            {
                case USB_REQ_GET_STATUS:
                    if (pdev->dev_state == USBD_STATE_CONFIGURED)
                    {
                        USBD_CtlSendData(pdev, (uint8_t*)(void*)&status_info,
                                         2U);
                    }
                    else
                    {
                        USBD_CtlError(pdev, req);
                        ret = USBD_FAIL;
                    }
                    break;

                case USB_REQ_GET_INTERFACE:
                    if (pdev->dev_state == USBD_STATE_CONFIGURED)
                    {
                        USBD_CtlSendData(pdev, &ifalt, 1U);
                    }
                    else
                    {
                        USBD_CtlError(pdev, req);
                        ret = USBD_FAIL;
                    }
                    break;

                case USB_REQ_SET_INTERFACE:
                    if (pdev->dev_state != USBD_STATE_CONFIGURED)
                    {
                        USBD_CtlError(pdev, req);
                        ret = USBD_FAIL;
                    }
                    break;

                default:
                    USBD_CtlError(pdev, req);
                    ret = USBD_FAIL;
                    break;
            }
            break;
        case USB_REQ_GET_DESCRIPTOR:
        {
            uint16_t len = 0U;
            uint8_t* pbuf = NULL;
            if (req->wValue >> 8 == CUSTOM_HID_REPORT_DESC)
            {
                len = MIN(USBD_CUSTOM_HID_REPORT_DESC_SIZE, req->wLength);
                pbuf = ((USBD_CDC_ItfTypeDef*)pdev->pUserData)->pReport;
            }
            else
            {
                if (req->wValue >> 8 == CUSTOM_HID_DESCRIPTOR_TYPE)
                {
                    pbuf = USBD_CUSTOM_HID_Desc;
                    len = MIN(USB_CUSTOM_HID_DESC_SIZ, req->wLength);
                }
            }

            USBD_CtlSendData(pdev, pbuf, len);
            break;
        }
        default:
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
            break;
    }

    return ret;
}

/**
 * @brief  USBD_CDC_DataIn
 *         Data sent on non-control IN endpoint
 * @param  pdev: device instance
 * @param  epnum: endpoint number
 * @retval status
 */
static uint8_t USBD_CDC_DataIn(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, epnum);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }

    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];
    PCD_HandleTypeDef* hpcd = pdev->pData;

    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        if ((pdev->ep_in[epnum].total_length > 0U) &&
            ((pdev->ep_in[epnum].total_length % hpcd->IN_ep[epnum].maxpacket) ==
             0U))
        {
            /* Update the packet total length */
            pdev->ep_in[epnum].total_length = 0U;

            /* Send ZLP */
            USBD_LL_Transmit(pdev, epnum, NULL, 0U);
        }
        else
        {
            hcdc->TxState = 0U;
        }
        return USBD_OK;
    }
    else
    {
        return USBD_FAIL;
    }
}

/**
 * @brief  USBD_CDC_DataOut
 *         Data received on non-control Out endpoint
 * @param  pdev: device instance
 * @param  epnum: endpoint number
 * @retval status
 */
static uint8_t USBD_CDC_DataOut(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, epnum);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];

    /* Get the received data length */
    hcdc->RxLength = USBD_LL_GetRxDataSize(pdev, epnum);

    /* USB data will be immediately processed, this allow next USB traffic being
    NAKed till the end of the application Xfer */
    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
            ->Receive(hcdc->RxBuffer, &hcdc->RxLength);

        return USBD_OK;
    }
    else
    {
        return USBD_FAIL;
    }
}

/**
 * @brief  USBD_CDC_EP0_RxReady
 *         Handle EP0 Rx Ready event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_CDC_EP0_RxReady(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, epnum);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];

    if ((pdev->pUserData[interfaceIndex] != NULL) && (hcdc->CmdOpCode != 0xFFU))
    {
        ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
            ->Control(hcdc->CmdOpCode, (uint8_t*)(void*)hcdc->data,
                      (uint16_t)hcdc->CmdLength);
        hcdc->CmdOpCode = 0xFFU;
    }
    return USBD_OK;
}

/**
 * @brief  USBD_CDC_GetFSCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_CDC_GetFSCfgDesc(uint16_t* length)
{
    *length = sizeof(USBD_CDC_CfgFSDesc);
    return USBD_CDC_CfgFSDesc;
}

/**
 * @brief  USBD_CDC_GetHSCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_CDC_GetHSCfgDesc(uint16_t* length)
{
    *length = sizeof(USBD_CDC_CfgHSDesc);
    return USBD_CDC_CfgHSDesc;
}

/**
 * @brief  USBD_CDC_GetCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_CDC_GetOtherSpeedCfgDesc(uint16_t* length)
{
    *length = sizeof(USBD_CDC_OtherSpeedCfgDesc);
    return USBD_CDC_OtherSpeedCfgDesc;
}

/**
 * @brief  DeviceQualifierDescriptor
 *         return Device Qualifier descriptor
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
uint8_t* USBD_CDC_GetDeviceQualifierDescriptor(uint16_t* length)
{
    *length = sizeof(USBD_CDC_DeviceQualifierDesc);
    return USBD_CDC_DeviceQualifierDesc;
}

/**
 * @brief  USBD_CDC_RegisterInterface
 * @param  pdev: device instance
 * @param  fops: CD  Interface callback
 * @retval status
 */
uint8_t USBD_CDC_RegisterInterface(USBD_HandleTypeDef* pdev,
                                   USBD_CDC_ItfTypeDef* fops)
{
    uint8_t ret = USBD_FAIL;

    if (fops != NULL)
    {
        uint16_t configDesctiptorLen;
        CDC_Parse_Configuration(
            pdev, fops,
            pdev->pClass->GetFSConfigDescriptor(&configDesctiptorLen),
            configDesctiptorLen);
        ret = USBD_OK;
    }

    return ret;
}

/**
 * @brief  USBD_CDC_SetTxBuffer
 * @param  pdev: device instance
 * @param  pbuff: Tx Buffer
 * @retval status
 */
uint8_t USBD_CDC_SetTxBuffer(USBD_HandleTypeDef* pdev, uint8_t* pbuff,
                             uint16_t length)
{
    USBD_CDC_HandleTypeDef* hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[0];

    hcdc->TxBuffer = pbuff;
    hcdc->TxLength = length;

    return USBD_OK;
}

/**
 * @brief  USBD_CDC_SetRxBuffer
 * @param  pdev: device instance
 * @param  pbuff: Rx Buffer
 * @retval status
 */
uint8_t USBD_CDC_SetRxBuffer(USBD_HandleTypeDef* pdev, uint8_t* pbuff)
{
    USBD_CDC_HandleTypeDef* hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[0];

    hcdc->RxBuffer = pbuff;

    return USBD_OK;
}

/**
 * @brief  USBD_CDC_TransmitPacket
 *         Transmit packet on IN endpoint
 * @param  pdev: device instance
 * @retval status
 */
uint8_t USBD_CDC_TransmitPacket(USBD_HandleTypeDef* pdev)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, CDC_IN_EP);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];

    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        if (hcdc->TxState == 0U)
        {
            /* Tx Transfer in progress */
            hcdc->TxState = 1U;

            /* Update the packet total length */
            pdev->ep_in[CDC_IN_EP & 0xFU].total_length = hcdc->TxLength;

