PureBulb/stm32_CompositeDevice/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c
            /* Transmit next packet */
            USBD_LL_Transmit(pdev, CDC_IN_EP, hcdc->TxBuffer,
                             (uint16_t)hcdc->TxLength);

            return USBD_OK;
        }
        else
        {
            return USBD_BUSY;
        }
    }
    else
    {
        return USBD_FAIL;
    }
}

/**
 * @brief  USBD_CDC_ReceivePacket
 *         prepare OUT Endpoint for reception
 * @param  pdev: device instance
 * @retval status
 */
uint8_t USBD_CDC_ReceivePacket(USBD_HandleTypeDef* pdev)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, CDC_OUT_EP);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];
    /* Suspend or Resume USB Out process */
    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        if (pdev->dev_speed == USBD_SPEED_HIGH)
        {
            /* Prepare Out endpoint to receive next packet */
            USBD_LL_PrepareReceive(pdev, CDC_OUT_EP, hcdc->RxBuffer,
                                   CDC_DATA_HS_OUT_PACKET_SIZE);
        }
        else
        {
            /* Prepare Out endpoint to receive next packet */
            USBD_LL_PrepareReceive(pdev, CDC_OUT_EP, hcdc->RxBuffer,
                                   CDC_DATA_FS_OUT_PACKET_SIZE);
        }
        return USBD_OK;
    }
    else
    {
        return USBD_FAIL;
    }
}
/**
 * @}
 */
int8_t USBD_CDC_GetInterfaceIndexByEpNum(USBD_HandleTypeDef* pdev,
                                         uint8_t ep_addr)
{
    ep_addr &= EP_ADDR_MSK;
    for (int8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        for (int8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
        {
            uint8_t epAddr = fops->interfaceEpAddr[epIndex];
            if (epAddr == ep_addr)
            {
                return i;
            }
        }
    }
    return -1;
}
int8_t USBD_CDC_GetInterfaceIndexByIfNum(USBD_HandleTypeDef* pdev,
                                         uint8_t if_num)
{
    for (int8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        for (int8_t j = 0; j < fops->interfaceSize; j++)
        {
            uint8_t interfaceNum = fops->interfaceNumbers[j];
            if (interfaceNum == if_num)
            {
                return i;
            }
        }
    }
    return -1;
}

int8_t CDC_Parse_Configuration(USBD_HandleTypeDef* pdev,
                               USBD_CDC_ItfTypeDef* fops, uint8_t* cfgData,
                               uint16_t length)
{
    uint8_t seek = 0;
    uint8_t ret = USBD_OK;
    USBD_CDC_ItfTypeDef* succRegFops = NULL;
    uint8_t endpointNum = 0;
    while (seek < length)
    {
        uint8_t descLen = cfgData[seek];
        uint8_t descType = cfgData[seek + 1];
        switch (descType)
        {
            case USB_DESC_TYPE_INTERFACE:
                succRegFops = NULL;
                ret = CDC_Parse_Interface(pdev, fops, &cfgData[seek],
                                          &endpointNum);
                succRegFops = (ret == USBD_OK) ? fops : succRegFops;
                seek += descLen;
                break;
            case USB_DESC_TYPE_ENDPOINT:
                if (endpointNum != 0)
                    ret = CDC_Parse_Endpoint(succRegFops, &cfgData[seek]);
                seek += descLen;
                endpointNum--;
                if (endpointNum == 0) succRegFops = NULL;
                break;
            default:
                seek += descLen;
                break;
        }
        if (ret != USBD_OK) break;
    }
    return ret;
}
int8_t CDC_Parse_Interface(USBD_HandleTypeDef* pdev, USBD_CDC_ItfTypeDef* fops,
                           uint8_t* interfaceData, uint8_t* endpointNum)
{
    *endpointNum = 0;
    int8_t isFind = 0;
    uint8_t interfaceClassType = interfaceData[5];
    for (uint8_t i = 0; i < INTERFACE_MAX_EP_NUM; i++)
    {
        if (fops->interfaceClassType[i] != 0 &&
            fops->interfaceClassType[i] == interfaceClassType)
        {
            isFind = 1;
            break;
        }
    }
    if (isFind)
    {
        fops->interfaceNumbers[fops->interfaceSize++] = interfaceData[2];
        *endpointNum = interfaceData[4];
        // Found CDC Interface
        if (fops->isRegistered != 0u)
        {
            return USBD_OK;
        }
        fops->isRegistered = 1;
        pdev->pUserData[pdev->interfaceSize++] = fops;

        return USBD_OK;
    }
    return USBD_FAIL;
}
int8_t CDC_Parse_Endpoint(USBD_CDC_ItfTypeDef* fops, uint8_t* endpointData)
{
    if (NULL == fops) return USBD_OK;
    if (fops->endpointSize >= INTERFACE_MAX_EP_NUM) return USBD_FAIL;
    fops->interfaceEpAddr[fops->endpointSize++] = endpointData[2];
    fops->interfaceEpAttr[fops->endpointSize - 1] = endpointData[3];
    return USBD_OK;
}
/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
